### Notebook para criar algumas análises dos dados de um hipotético E-commerce

- Dataset extraído de: [data.word](https://data.world/jerrys/sql-12-applying-functions-in-sql)

In [2]:
!pip install psycopg2-binary pandas matplotlib seaborn sqlalchemy

Requirement already satisfied: psycopg2-binary in c:\users\denni\appdata\local\programs\python\python310\lib\site-packages (2.9.9)
Requirement already satisfied: pandas in c:\users\denni\appdata\local\programs\python\python310\lib\site-packages (2.2.0)
Collecting matplotlib
  Downloading matplotlib-3.8.3-cp310-cp310-win_amd64.whl.metadata (5.9 kB)
Collecting seaborn
  Downloading seaborn-0.13.2-py3-none-any.whl.metadata (5.4 kB)
Requirement already satisfied: sqlalchemy in c:\users\denni\appdata\local\programs\python\python310\lib\site-packages (2.0.27)
Requirement already satisfied: numpy<2,>=1.22.4 in c:\users\denni\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\denni\appdata\roaming\python\python310\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\denni\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\denni\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2024.1)
Collecting contourpy>=1.0.1 (from matplotlib)
  Downloading contourpy-1.2.0-cp310-cp310-win_amd64.whl.metadata (5.8 kB)
Collecting cycler>=0.10 (from matplotlib)
  Downloading cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib)
  Downloading fonttools-4.49.0-cp310-cp310-win_amd64.whl.metadata (162 kB)
     ---------------------------------------- 0.0/162.3 kB ? eta -:--:--
     -------------------------------------- 162.3/162.3 kB 4.8 MB/s eta 0:00:00
Collecting kiwisolver>=1.3.1 (from matplotlib)
  Downloading kiwisolver-1.4.5-cp310-cp310-win_amd64.whl.metadata (6.5 kB)
Requirement already satisfied: packaging>=20.0 in c:\users\denni\appdata\roaming\python\python310\site-packages (from matplotlib) (23.2)
Collecting pillow>=8 (from matplotlib)
  Downloading pillow-10.2.0-cp310-cp310-win_amd64.whl.metadata (9.9 kB)
Collecting pyparsing>=2.3.1 (from matplotlib)
  Downloading pyparsing-3.1.1-py3-none-any.whl.metadata (5.1 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\denni\appdata\local\programs\python\python310\lib\site-packages (from sqlalchemy) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\denni\appdata\local\programs\python\python310\lib\site-packages (from sqlalchemy) (3.0.1)
Requirement already satisfied: six>=1.5 in c:\users\denni\appdata\roaming\python\python310\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading matplotlib-3.8.3-cp310-cp310-win_amd64.whl (7.6 MB)
   ---------------------------------------- 0.0/7.6 MB ? eta -:--:--
   ------ --------------------------------- 1.2/7.6 MB 37.7 MB/s eta 0:00:01
   --------------- ------------------------ 2.9/7.6 MB 37.5 MB/s eta 0:00:01
   ------------------------ --------------- 4.8/7.6 MB 37.9 MB/s eta 0:00:01
   ---------------------------------- ----- 6.5/7.6 MB 38.0 MB/s eta 0:00:01
   ---------------------------------------  7.6/7.6 MB 37.6 MB/s eta 0:00:01
   ---------------------------------------- 7.6/7.6 MB 32.6 MB/s eta 0:00:00
Downloading seaborn-0.13.2-py3-none-any.whl (294 kB)
   ---------------------------------------- 0.0/294.9 kB ? eta -:--:--
   ---------------------------------------- 294.9/294.9 kB ? eta 0:00:00
Downloading contourpy-1.2.0-cp310-cp310-win_amd64.whl (186 kB)
   ---------------------------------------- 0.0/186.7 kB ? eta -:--:--
   ---------------------------------------- 186.7/186.7 kB ? eta 0:00:00
Downloading cycler-0.12.1-py3-none-any.whl (8.3 kB)
Downloading fonttools-4.49.0-cp310-cp310-win_amd64.whl (2.2 MB)
   ---------------------------------------- 0.0/2.2 MB ? eta -:--:--
   -------------------------- ------------- 1.4/2.2 MB 45.9 MB/s eta 0:00:01
   ---------------------------------------- 2.2/2.2 MB 27.8 MB/s eta 0:00:00
Downloading kiwisolver-1.4.5-cp310-cp310-win_amd64.whl (56 kB)
   ---------------------------------------- 0.0/56.1 kB ? eta -:--:--
   ---------------------------------------- 56.1/56.1 kB ? eta 0:00:00
Downloading pillow-10.2.0-cp310-cp310-win_amd64.whl (2.6 MB)
   ---------------------------------------- 0.0/2.6 MB ? eta -:--:--
   ----------------------------- ---------- 1.9/2.6 MB 40.3 MB/s eta 0:00:01
   ---------------------------------------- 2.6/2.6 MB 27.8 MB/s eta 0:00:00
Downloading pyparsing-3.1.1-py3-none-any.whl (103 kB)
   ---------------------------------------- 0.0/103.1 kB ? eta -:--:--
   ---------------------------------------- 103.1/103.1 kB 5.8 MB/s eta 0:00:00
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib, seaborn
Successfully installed contourpy-1.2.0 cycler-0.12.1 fonttools-4.49.0 kiwisolver-1.4.5 matplotlib-3.8.3 pillow-10.2.0 pyparsing-3.1.1 seaborn-0.13.2

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sqlalchemy import create_engine

In [4]:
# string de conexão com o banco de dados ecommerce
engine = create_engine('postgresql://postgres:gorilaamarelo1@localhost:5432/ecommerce')

In [5]:
# select amostra da tabela produtos
produtos = pd.read_sql("SELECT * FROM produtos LIMIT 10;", engine); produtos.head()

     Codigo                                       Produto    Preco
0  BS001873                         Apple Lightning Cable   $21.99
1  BS001874                     SanDisk Extreme microSDXC   $31.50
2  BS001875            Seagate 2TB Expansion Portable HDD   $79.00
3  BS001876  TicWatch Pro 3 Ultra GPS Smartwatch Qualcomm  $399.00
4  BS001877                    Webcam HD 1080p Web Camera   $59.00

In [6]:
# select amostra da tabela vendas
vendas = pd.read_sql("SELECT * FROM vendas LIMIT 10;", engine); vendas.head()

,Order ID,Date,ship-service-level,Style,Codigo,Courier Status,Qty,ship-country,Fulfillment
0,171-8536041-9190708,6/29/2022,Expedited,SET400,BS001879,Cancelled,4,AU,Yes
1,407-4176879-6571509,6/29/2022,Expedited,JNE3486,BS001890,Cancelled,2,BR,Yes
2,404-4382011-4681149,6/29/2022,Expedited,JNE3887,BS001873,Cancelled,2,BR,Yes
3,406-3412504-2471555,6/29/2022,Expedited,JNE3487,BS001888,Cancelled,2,BR,Yes
4,408-2481787-8248368,6/29/2022,Expedited,JNE3566,BS001898,Cancelled,2,BR,Yes

In [9]:
view1 = pd.read_sql("select * from produto_mais_vendido_quantidade", engine); view1.head()

,Codigo,Produto,total_ocorrencias
0,BS001878,Logitech MK270R Wireless Keyboard and Mouse Combo,5049
1,BS001881,TP-Link Tapo Pan/Tilt Smart Security Camera,5049
2,BS001889,Taco Cat Goat Cheese Pizza Card Game,5049
3,BS001891,PHILIPS Sonicare 9900 Prestige Power Toothbrush,5049
4,BS001894,Sony WH1000XM4 Noise Canceling Wireless Headph...,5049

In [14]:
view1 = pd.read_sql("select * from produto_mais_vendido_quantidade", engine); view1.head()

,Codigo,Produto,total_ocorrencias
0,BS001878,Logitech MK270R Wireless Keyboard and Mouse Combo,5049
1,BS001881,TP-Link Tapo Pan/Tilt Smart Security Camera,5049
2,BS001889,Taco Cat Goat Cheese Pizza Card Game,5049
3,BS001891,PHILIPS Sonicare 9900 Prestige Power Toothbrush,5049
4,BS001894,Sony WH1000XM4 Noise Canceling Wireless Headph...,5049

In [15]:
view2 = pd.read_sql("select * from pais_mais_vendas", engine); view2.head()

  ship-country  total_paises
0           BR         14384

In [16]:
view3 = pd.read_sql("select * from service_mais_usado", engine); view3.head();

     Style  total_style
0  JNE3797         4224

In [17]:
view4 = pd.read_sql("select * from total_vendas", engine); view4.head()

  month  count_cases
0     6        37697
1     4        49067
2     5        42040

In [18]:
view5 = pd.read_sql("select * from nunca_vendido", engine); view5.head()

Empty DataFrame
Columns: [Codigo]
Index: []

In [19]:
view6 = pd.read_sql("select * from qtd_entregue", engine); view6.head()

  Courier Status  entregues
0        Shipped     116063

In [20]:
view7 = pd.read_sql("select * from service_mais_popular", engine); view7.head()

  ship-service-level  servicos
0          Expedited     88615

In [21]:
view8 = pd.read_sql("select * from produto_mais_cancelado", engine); view8.head()

     Codigo Courier Status  total_ocorrencias
0  BS001900      Cancelled                246

In [22]:
view9 = pd.read_sql("select * from qtd_pedido_por_pais", engine); view9.head()

  ship-country  quantidade_pedidos
0           BR             43092.0
1           AU             43028.0
2           DK             42994.0
3           UK             43070.0
4           GE             42754.0

In [23]:
view10 = pd.read_sql("select * from pais_maior_vendas_concluidas", engine); view10.head()

  ship-country  total_vendas_concluidas
0           BR                    13698

In [24]:
view11 = pd.read_sql("select * from correlacao_style_codigo", engine); view11.head()

     Codigo    Style  total_style
0  BS001880  JNE3797          188
1  BS001875  JNE3797          178
2  BS001881  JNE3797          178
3  BS001900  JNE3797          178
4  BS001890  JNE3797          172

In [25]:
view12 = pd.read_sql("select * from produtos_mais_vendidos_por_pais", engine); view12.head()

,ship-country,Codigo,Produto,total_vendas
0,AU,BS001900,YABER WiFi Projector Mini Portable Projector 6...,586
1,AU,BS001892,Kindle Paperwhite (8GB),573
2,AU,BS001889,Taco Cat Goat Cheese Pizza Card Game,570
3,AU,BS001891,PHILIPS Sonicare 9900 Prestige Power Toothbrush,567
4,AU,BS001880,HyperX QuadCast S – RGB USB Condenser Micropho...,561

In [26]:
view13 = pd.read_sql("select * from produto_mais_cancelado_2", engine); view13.head()

,Codigo,Produto,total_cancelamentos
0,BS001900,YABER WiFi Projector Mini Portable Projector 6...,246

In [27]:
view14 = pd.read_sql("select * from produto_mais_vendido_receita", engine); view14.head()

                                             Produto  receita_total
0  Sony WH1000XM4 Noise Canceling Wireless Headph...      5841990.0

In [28]:
view15 = pd.read_sql("select * from mes_maior_fulfillment", engine); view15.head()

   mes  total_entregas
0  4.0           46809